FILES/InformationRegisters/ДоступныеЧатБоты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЧатБоты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЧата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СистемаЧатБота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыДляЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательОБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ЧатСПользователямиОБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЧатСПользователямиОБТ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПрикрепленныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательОБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыДляЧатов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Система</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыДляЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВладелецСообщенияЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Enums/ТипЗапросаСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипЗапросаСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Enums/ВладелецСообщенияЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВладелецСообщенияЧата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Documents/ЗаказИзКорзины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗаказИзКорзины</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Командируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураБТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭкстраПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляЭкстраПолей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляЭкстраПолей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FILES/Catalogs/СервисыШины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СервисыШины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерверШины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервераШины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ПользователиОБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПользователиОБТ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Командируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>ХешПароля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/CommonModules/ЧатБотБТСервер/Ext/Module.bsl
Функция СформироватьЭлементСервиса(СервисШины)
	
	Сервис = Новый Структура;
	
	ТекстURL = "";
	Если СервисШины.СпособПередачиПараметров = "GET" Тогда
		Для Каждого Параметр ИЗ СервисШины.Параметры Цикл
			Если ТекстURL <> "" Тогда
				ТекстURL = ТекстURL + "&";
			КонецЕсли;	
			ТекстURL = ТекстURL + Параметр.ИмяПараметра + "=" + Параметр.ШаблонЗначения; 
		КонецЦикла;
		
		Если ТекстURL <> "" Тогда
			ТекстURL = "?" + ТекстURL;
		КонецЕсли; 
		
	ИначеЕсли СервисШины.СпособПередачиПараметров = "BODY" Тогда
		
		ТекстТела = Новый Структура;
		Для Каждого Параметр ИЗ СервисШины.Параметры Цикл	
			ТекстТела.Вставить(Параметр.ИмяПараметра, Параметр.ШаблонЗначения);
		КонецЦикла;
		ТекстТела = УправлениеБТВызовСервера.ВJSON(ТекстТела);
		Сервис.Вставить("templatebody", ТекстТела);	
		
	ИначеЕсли СервисШины.СпособПередачиПараметров = "REST" Тогда
		
		Для Каждого Параметр ИЗ СервисШины.Параметры Цикл
			Если ТекстURL <> "" Тогда
				ТекстURL = ТекстURL + "/";
			КонецЕсли;	
			ТекстURL = ТекстURL + Параметр.ШаблонЗначения; 
		КонецЦикла;
		
		Если ТекстURL <> "" Тогда
			ТекстURL = "/" + ТекстURL;
		КонецЕсли; 
	
	КонецЕсли;
	
	
	URL = ?(СервисШины.СерверШины.ЗащищенноеСоединение, "https://", "http://") + СервисШины.СерверШины.URL;
	Сервис.Вставить("URL",  URL + СервисШины.URL + ТекстURL);	
	Сервис.Вставить("method", СервисШины.МетодПередачи);	
	Сервис.Вставить("auth", УправлениеБТВызовСервера.Base64Кодировать(СервисШины.СерверШины.Логин + ":" + СервисШины.СерверШины.Пароль));	
	
	Возврат Сервис;
	
КонецФункции

Функция СформироватьЭлементДерева(Правило, Последовательность, СтекОбработанных) Экспорт
	
	//ВнутреннийСтек = СтекОбработанных;
	Если СтекОбработанных.Найти(Правило.Идентификатор) <> Неопределено Тогда
		Элемент = Новый Структура;
		Элемент.Вставить("goto",  Строка(Правило.Идентификатор));		
	Иначе
		
		СтекОбработанных.Добавить(Строка(Правило.Идентификатор));
		
		Элемент = Новый Структура;
		Элемент.Вставить("ID",  Строка(Правило.Идентификатор));
		Элемент.Вставить("type",  Строка(Правило.ТипЗапроса));
		Элемент.Вставить("name" , Правило.Представление);
		Элемент.Вставить("query",  Правило.СопровождающийТекст);
		Элемент.Вставить("option",  Правило.УсловиеПредшественника);
		Элемент.Вставить("exoption",  Правило.РасширенноеУсловие);
		Элемент.Вставить("exname",  Правило.РасширенныйСопровождающийТекст);
		Если Правило.СервисШины <> Справочники.СервисыШины.ПустаяСсылка() И ТипЗнч(Правило.СервисШины) = Тип("СправочникСсылка.СервисыШины") Тогда
			Элемент.Вставить("service",  СформироватьЭлементСервиса(Правило.СервисШины));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Правило.Следующий) Тогда
			
			МассивСледующихЭлементов = Новый Массив;		
			СледующееПравило = Последовательность.Найти(Правило.Следующий, "Идентификатор");
			
			СледующийЭлемент = СформироватьЭлементДерева(СледующееПравило, Последовательность, СтекОбработанных);
			МассивСледующихЭлементов.Добавить(СледующийЭлемент);
		
			Элемент.Вставить("NextQuery", СледующийЭлемент);
		Иначе
			Отбор = Новый Структура();
			Отбор.Вставить("Предшественник", Правило.Идентификатор);
			СледующиеСтроки = Последовательность.НайтиСтроки(Отбор);

			МассивСледующихЭлементов = Новый Массив;
			Для Каждого СледующееПравило ИЗ СледующиеСтроки Цикл
				СледующийЭлемент = СформироватьЭлементДерева(СледующееПравило, Последовательность, СтекОбработанных);
				МассивСледующихЭлементов.Добавить(СледующийЭлемент);
			КонецЦикла;
			
			Если МассивСледующихЭлементов.Количество() > 0 Тогда 
				Элемент.Вставить("NextQuery", МассивСледующихЭлементов);
			КонецЕсли;		
		КонецЕсли;
		
		СтекОбработанных.Удалить(СтекОбработанных.Количество()-1);
		
	КонецЕсли;
	
	
	Возврат Элемент; 
	
КонецФункции

Функция СформироватьДеревоВопросовПоДокументу(СсылкаНаДокумент) Экспорт
		
	СтекОбработанных = Новый Массив;
	Последовательность = СсылкаНаДокумент.Последовательность;	
	СтрокаНачала = Последовательность.Найти(Перечисления.ТипЗапросаСхемы.Старт, "ТипЗапроса");
	Если СтрокаНачала <> Неопределено Тогда 	
		Дерево = СформироватьЭлементДерева(СтрокаНачала, Последовательность, СтекОбработанных);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции





//////////////////////////////////////////////////////////////////////////
//								HTTP service
//////////////////////////////////////////////////////////////////////////

#Область HTTPСервисы

//
// 							ChatBot
//

Функция ПолучитьЧатДляПользователя(ПользовательОБТ, Система)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДоступныеЧатБоты.Регистратор КАК Регистратор,
	               |	ДоступныеЧатБоты.НомерСтроки КАК НомерСтроки,
	               |	ДоступныеЧатБоты.Активность КАК Активность,
	               |	ДоступныеЧатБоты.СистемаЧатБота КАК СистемаЧатБота,
	               |	ДоступныеЧатБоты.Партнер КАК Партнер,
	               |	ДоступныеЧатБоты.Контрагент КАК Контрагент,
	               |	ДоступныеЧатБоты.ПользовательОБТ КАК ПользовательОБТ,
	               |	ДоступныеЧатБоты.ТекстЧата КАК ТекстЧата
	               |ИЗ
	               |	РегистрСведений.ДоступныеЧатБоты КАК ДоступныеЧатБоты
	               |ГДЕ
	               |	ДоступныеЧатБоты.ПользовательОБТ = &ПользовательОБТ
	               |	И ДоступныеЧатБоты.СистемаЧатБота = &СистемаЧатБота
	               |	И ВЫБОР
	               |			КОГДА &ИспользоватьПартнера
	               |				ТОГДА ДоступныеЧатБоты.Партнер В (&Партнер)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ИспользоватьКонтрагента
	               |				ТОГДА ДоступныеЧатБоты.Контрагент В (&Контрагент)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("СистемаЧатБота", Система);
	Если ПользовательОБТ = Справочники.ПользователиОБТ.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("ПользовательОБТ", ПользовательОБТ);
		Запрос.УстановитьПараметр("ИспользоватьПартнера", Ложь);
		Запрос.УстановитьПараметр("ИспользоватьКонтрагента", Ложь);
		Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.ПустаяСсылка());
		Запрос.УстановитьПараметр("Контрагент", Справочники.Партнеры.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("ИспользоватьПартнера", Истина);
		Запрос.УстановитьПараметр("ИспользоватьКонтрагента", Истина);
		Запрос.УстановитьПараметр("ПользовательОБТ", ПользовательОБТ.ПользовательОБТ);
		Запрос.УстановитьПараметр("Партнер", ПользовательОБТ.Партнеры);
		Запрос.УстановитьПараметр("Контрагент", ПользовательОБТ.Контрагенты);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ТекстЧата;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ChatBOTПолучитьЧат(Запрос) Экспорт
	Ответ = Новый HTTPСервисОтвет(500);
	
	Если ТипЗнч(Запрос) = Тип("Структура") Тогда
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку;
	Иначе
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();		
	КонецЕсли;
	
	typechat = Запрос.ПараметрыURL["typechat"];
	СистемаЧатБота = Перечисления.СистемыДляЧатов[typechat];
	
	ЖСОН = УправлениеБТВызовСервера.ИзJSON(ТелоЗапроса);	
	КарточкаПользователя = УправлениеБТСервер.ПолучитьДанныеПоПользователю(ЖСОН);
	Если КарточкаПользователя <> Неопределено Тогда 
		ТекстЧатБот = ПолучитьЧатДляПользователя(КарточкаПользователя, СистемаЧатБота);
		Если ЗначениеЗаполнено(ТекстЧатБот) Тогда 
			Ответ.КодСостояния = 200;
			Ответ.УстановитьТелоИзСтроки(ТекстЧатБот);
		КонецЕсли;
		
	Иначе
		//Безъимянный пользоваель вернем чат по умолчанию: если он есть
		ТекстЧатБот = ПолучитьЧатДляПользователя(Справочники.ПользователиОБТ.ПустаяСсылка(), СистемаЧатБота);
		Если ЗначениеЗаполнено(ТекстЧатБот) Тогда 
			Ответ.КодСостояния = 200;
			Ответ.УстановитьТелоИзСтроки(ТекстЧатБот);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;		
КонецФункции


Функция СоздатьНовыйЗаказ(ПользовательОБТ)
	
	НовыйОбъект = ИИСервер.ВернутьОписаниеСсылки(Документы.ЗаказИзКорзины.ПустаяСсылка(), Неопределено);
	Если ТипЗнч(ПользовательОБТ) = Тип("СправочникСсылка.ПользователиОБТ") Тогда
		//
	Иначе
		НовыйОбъект.Дата = ТекущаяДата();
		НовыйОбъект.Командируемый = ПользовательОБТ.ПользовательОБТ.Командируемый;
		НовыйОбъект.Партнер = Справочники.Партнеры.ПустаяСсылка();
		НовыйОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		НовыйОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ОбъектЗаказ =  ИИСервер.ПолучитьСсылкуНаОбъект(НовыйОбъект);
	ОбъектЗаказ.Записать();
	СсылкаНаЗаказ = ОбъектЗаказ.Ссылка;
		
	Возврат СсылкаНаЗаказ;
	
КонецФункции

Функция РазобратьОтветыБота(СсылкаНаОбъект, ПользовательОБТ, СистемаЧатБота, ОтветыИзЧатБота, МассивОтветовЧата = Неопределено)
	
	Если МассивОтветовЧата = Неопределено Тогда
		МассивОтветовЧата = Новый Массив;	
	КонецЕсли;
	
	Для Каждого ОтветЧатБота ИЗ ОтветыИзЧатБота Цикл
		Если ОтветЧатБота.Свойство("type") Тогда
			Если ОтветЧатБота.type <> "Старт" И ОтветЧатБота.type <> "Завершение" Тогда
				//Обработаем ответ
				
				Если ОтветЧатБота.Свойство("ask") Тогда
					Если ТипЗнч(ОтветЧатБота.ask) = Тип("Массив") Тогда
						//Это сложный ответ, обработаем в рекурсии
						МассивОтветовЧата = РазобратьОтветыБота(СсылкаНаОбъект, ПользовательОБТ, СистемаЧатБота, ОтветЧатБота.ask, МассивОтветовЧата);
					Иначе
						Сообщение = ОтветЧатБота.query;
						ВопросБота = Новый Структура("Владелец, ПользовательОБТ, Пользователь, Объект, Система, Сообщение", Перечисления.ВладелецСообщенияЧата.Автоматически, ПользовательОБТ, СистемаЧатБота, СсылкаНаОбъект, СистемаЧатБота, Сообщение);
						МассивОтветовЧата.Добавить(ВопросБота);
						
						Сообщение = ОтветЧатБота.ask;
						ОтветБота = Новый Структура("Владелец, ПользовательОБТ, Пользователь, Объект, Система, Сообщение", Перечисления.ВладелецСообщенияЧата.Клиент, ПользовательОБТ, СистемаЧатБота, СсылкаНаОбъект, СистемаЧатБота, Сообщение);
						МассивОтветовЧата.Добавить(ОтветБота);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтветовЧата;
	
КонецФункции

Функция СохранитьЧат(МассивОтветовЧата)
	
	МоментВремени = ТекущаяДата()-500;
	Для Каждого ОтветЧата ИЗ МассивОтветовЧата Цикл
		
		МоментВремени = МоментВремени+1;
		Чат = РегистрыСведений.ЧатСПользователямиОБТ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Чат, ОтветЧата);
		Чат.Период = МоментВремени;
		Чат.КлючСообщения = Новый УникальныйИдентификатор();
		Чат.Записать(Истина);
		
	КонецЦикла;
	
КонецФункции

Функция ChatBOTСоздатьЗаказ(Запрос) Экспорт
	Ответ = Новый HTTPСервисОтвет(500);
	
	Если ТипЗнч(Запрос) = Тип("Структура") Тогда
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку;
	Иначе
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();		
	КонецЕсли;
	
	typechat = Запрос.ПараметрыURL["typechat"];
	СистемаЧатБота = Перечисления.СистемыДляЧатов[typechat];
	
	КарточкаПользователя = Неопределено;
	ЖСОН = УправлениеБТВызовСервера.ИзJSON(ТелоЗапроса);
	КарточкаПользователя = УправлениеБТСервер.ПолучитьДанныеПоПользователю(ЖСОН);
	
	Ответы = Неопределено;
	ЖСОН = УправлениеБТВызовСервера.ИзJSON(ТелоЗапроса);
	Если ЖСОН.Свойство("answer") Тогда
		Ответы = ЖСОН["answer"];
	КонецЕсли;

	Если КарточкаПользователя <> Неопределено Тогда 
		 СсылкаНаЗаказ = СоздатьНовыйЗаказ(КарточкаПользователя);
		 МассивОтветовЧата = РазобратьОтветыБота(СсылкаНаЗаказ, КарточкаПользователя.ПользовательОБТ, СистемаЧатБота, Ответы);
		 СохранитьЧат(МассивОтветовЧата);
	Иначе
		//Безъимянный пользоваель, хз что с ним делать
		
	КонецЕсли;
	
	Возврат Ответ;		
КонецФункции

#КонецОбласти
